bench/results/rest-size1000.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/service-to-service.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 55s max duration (incl. graceful stop):
              * default: 50 looping VUs for 25s (gracefulStop: 30s)


running (01.0s), 50/50 VUs, 7710 complete and 0 interrupted iterations
default   [   4% ] 50 VUs  01.0s/25s

running (02.0s), 50/50 VUs, 16242 complete and 0 interrupted iterations
default   [   8% ] 50 VUs  02.0s/25s

running (03.0s), 50/50 VUs, 25375 complete and 0 interrupted iterations
default   [  12% ] 50 VUs  03.0s/25s

running (04.0s), 50/50 VUs, 34901 complete and 0 interrupted iterations
default   [  16% ] 50 VUs  04.0s/25s

running (05.0s), 50/50 VUs, 44110 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  05.0s/25s

running (06.0s), 50/50 VUs, 53401 complete and 0 interrupted iterations
default   [  24% ] 50 VUs  06.0s/25s

running (07.0s), 50/50 VUs, 62810 complete and 0 interrupted iterations
default   [  28% ] 50 VUs  07.0s/25s

running (08.0s), 50/50 VUs, 71834 complete and 0 interrupted iterations
default   [  32% ] 50 VUs  08.0s/25s

running (09.0s), 50/50 VUs, 80660 complete and 0 interrupted iterations
default   [  36% ] 50 VUs  09.0s/25s

running (10.0s), 50/50 VUs, 90008 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  10.0s/25s

running (11.0s), 50/50 VUs, 99298 complete and 0 interrupted iterations
default   [  44% ] 50 VUs  11.0s/25s

running (12.0s), 50/50 VUs, 108837 complete and 0 interrupted iterations
default   [  48% ] 50 VUs  12.0s/25s

running (13.0s), 50/50 VUs, 118224 complete and 0 interrupted iterations
default   [  52% ] 50 VUs  13.0s/25s

running (14.0s), 50/50 VUs, 127518 complete and 0 interrupted iterations
default   [  56% ] 50 VUs  14.0s/25s

running (15.0s), 50/50 VUs, 136210 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  15.0s/25s

running (16.0s), 50/50 VUs, 144851 complete and 0 interrupted iterations
default   [  64% ] 50 VUs  16.0s/25s

running (17.0s), 50/50 VUs, 153758 complete and 0 interrupted iterations
default   [  68% ] 50 VUs  17.0s/25s

running (18.0s), 50/50 VUs, 160677 complete and 0 interrupted iterations
default   [  72% ] 50 VUs  18.0s/25s

running (19.0s), 50/50 VUs, 168363 complete and 0 interrupted iterations
default   [  76% ] 50 VUs  19.0s/25s

running (20.0s), 50/50 VUs, 176889 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  20.0s/25s

running (21.0s), 50/50 VUs, 186238 complete and 0 interrupted iterations
default   [  84% ] 50 VUs  21.0s/25s

running (22.0s), 50/50 VUs, 195652 complete and 0 interrupted iterations
default   [  88% ] 50 VUs  22.0s/25s

running (23.0s), 50/50 VUs, 205039 complete and 0 interrupted iterations
default   [  92% ] 50 VUs  23.0s/25s

running (24.0s), 50/50 VUs, 214426 complete and 0 interrupted iterations
default   [  96% ] 50 VUs  24.0s/25s

running (25.0s), 50/50 VUs, 223745 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  25.0s/25s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 447654  17903.923442/s
    checks_succeeded...: 100.00% 447654 out of 447654
    checks_failed......: 0.00%   0 out of 447654

    ✓ status 200
    ✓ count matches

    CUSTOM
    upstream_micros................: avg=3032.040259 min=377      med=1426   max=241577   p(90)=4436  p(95)=7257   

    HTTP
    http_req_duration..............: avg=5.47ms      min=468µs    med=3.94ms max=246.1ms  p(90)=7.3ms p(95)=10.41ms
      { expected_response:true }...: avg=5.47ms      min=468µs    med=3.94ms max=246.1ms  p(90)=7.3ms p(95)=10.41ms
    http_req_failed................: 0.00%  0 out of 223827
    http_reqs......................: 223827 8951.961721/s

    EXECUTION
    iteration_duration.............: avg=5.57ms      min=495.45µs med=4.01ms max=246.15ms p(90)=7.5ms p(95)=10.72ms
    iterations.....................: 223827 8951.961721/s
    vus............................: 50     min=50          max=50
    vus_max........................: 50     min=50          max=50

    NETWORK
    data_received..................: 56 MB  2.2 MB/s
    data_sent......................: 21 MB  842 kB/s



running (25.0s), 00/50 VUs, 223827 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  25s